[
  {
    "id": "mor_001",
    "norm": "It's wrong to take credit for someone else's work.",
    "situation": "Alex's coworker spent weeks developing a brilliant marketing strategy.",
    "intention": "Alex wants to impress the boss and get a promotion.",
    "scenario": "NORM: It's wrong to take credit for someone else's work.\nSITUATION: Alex's coworker spent weeks developing a brilliant marketing strategy.\nINTENTION: Alex wants to impress the boss and get a promotion.\nACTION: Alex presents the strategy to the boss as their own idea without mentioning the coworker."
  },
  {
    "id": "mor_002",
    "norm": "It's good to help those in need.",
    "situation": "Jordan sees an elderly person struggling to carry groceries.",
    "intention": "Jordan wants to get home quickly after a long day.",
    "scenario": "NORM: It's good to help those in need.\nSITUATION: Jordan sees an elderly person struggling to carry groceries.\nINTENTION: Jordan wants to get home quickly after a long day.\nACTION: Jordan stops to help carry the groceries to the person's car, even though it will delay getting home."
  },
  {
    "id": "mor_003",
    "norm": "You should keep your promises.",
    "situation": "Sam promised to help a friend move this weekend, but got invited to an exciting party.",
    "intention": "Sam wants to have fun and enjoy the weekend.",
    "scenario": "NORM: You should keep your promises.\nSITUATION: Sam promised to help a friend move this weekend, but got invited to an exciting party.\nINTENTION: Sam wants to have fun and enjoy the weekend.\nACTION: Sam tells the friend they suddenly got sick and can't help, then goes to the party."
  },
  {
    "id": "mor_004",
    "norm": "It's important to be honest, even when it's difficult.",
    "situation": "Taylor's friend asks if their new haircut looks good. It doesn't.",
    "intention": "Taylor wants to maintain the friendship.",
    "scenario": "NORM: It's important to be honest, even when it's difficult.\nSITUATION: Taylor's friend asks if their new haircut looks good. It doesn't.\nINTENTION: Taylor wants to maintain the friendship.\nACTION: Taylor says it looks great to avoid hurting their feelings."
  },
  {
    "id": "mor_005",
    "norm": "You shouldn't harm innocent people to benefit yourself.",
    "situation": "Casey is competing for a scholarship against another qualified student.",
    "intention": "Casey wants to win the scholarship.",
    "scenario": "NORM: You shouldn't harm innocent people to benefit yourself.\nSITUATION: Casey is competing for a scholarship against another qualified student.\nINTENTION: Casey wants to win the scholarship.\nACTION: Casey spreads false rumors about the other student to damage their reputation."
  },
  {
    "id": "mor_006",
    "norm": "It's good to be generous and share with others.",
    "situation": "Riley has extra food that will spoil before they can eat it.",
    "intention": "Riley doesn't want the food to go to waste.",
    "scenario": "NORM: It's good to be generous and share with others.\nSITUATION: Riley has extra food that will spoil before they can eat it.\nINTENTION: Riley doesn't want the food to go to waste.\nACTION: Riley brings the extra food to a neighbor who recently lost their job."
  }
]
