[
  {
    "id": "dec_001",
    "review": "This was hands down the best hotel I've ever stayed at! The service was absolutely amazing and everything was perfect. I would recommend this to anyone looking for an incredible experience. Five stars all the way!"
  },
  {
    "id": "dec_002",
    "review": "Room 412 was spacious with a view of the lake. The bathroom had good water pressure but the grout needed cleaning. Front desk staff (Maria) was helpful when I asked about late checkout. Would stay again for the location."
  },
  {
    "id": "dec_003",
    "review": "My husband and I came here for our anniversary trip and we had the time of our lives! From the moment we walked in, we knew this was going to be special. Everything exceeded our expectations."
  },
  {
    "id": "dec_004",
    "review": "Bed was comfortable, AC worked well. Street noise was noticeable on the 3rd floor facing Michigan Ave. Breakfast buffet had standard options - eggs, bacon, fruit. $15 valet parking is steep but expected downtown."
  },
  {
    "id": "dec_005",
    "review": "I travel a lot for business and this is definitely my favorite hotel in the city. The staff treats you like family and the amenities are top-notch. Can't say enough good things about this place!"
  },
  {
    "id": "dec_006",
    "review": "Stayed 3 nights in early March. Room was clean but small for the price ($189/night). WiFi was slow during evening hours. The rooftop bar had nice views but drinks were overpriced. Fine for a short business trip."
  },
  {
    "id": "dec_007",
    "review": "What an incredible experience! This hotel is a hidden gem and I can't believe more people don't know about it. The location is perfect and the rooms are beautiful. I'll definitely be back!"
  },
  {
    "id": "dec_008",
    "review": "King suite had a pull-out couch that was lumpy. Housekeeping came late (4pm). Gym equipment was dated but functional. Appreciated the complimentary cookies at check-in. Pool closes at 9pm which was inconvenient."
  }
]
