[
  {
    "id": "ece_001",
    "dialogue": "Speaker A: I heard you got the promotion! Congratulations!\nSpeaker B: Thank you so much! I've been working towards this for three years.\n[TARGET] Speaker B: I'm absolutely thrilled - this is a dream come true!"
  },
  {
    "id": "ece_002",
    "dialogue": "Speaker A: Did you hear? They cancelled the concert we had tickets for.\nSpeaker B: What? We've been planning this for months!\n[TARGET] Speaker B: I can't believe it. I'm so disappointed."
  },
  {
    "id": "ece_003",
    "dialogue": "Speaker A: I'm sorry, but I have to tell you something. Your dog got out of the yard.\nSpeaker B: What happened? Is he okay?\nSpeaker A: We couldn't find him. He's been missing for two days.\n[TARGET] Speaker B: Oh no... I don't know what I'll do if something happened to him."
  },
  {
    "id": "ece_004",
    "dialogue": "Speaker A: You said you'd pick up the kids at 3!\nSpeaker B: I told you I had a meeting until 4.\nSpeaker A: No, you didn't! They waited at school for an hour!\n[TARGET] Speaker B: This is ridiculous! You never listen to anything I say!"
  },
  {
    "id": "ece_005",
    "dialogue": "Speaker A: Guess what? I just got a call from the hospital.\nSpeaker B: And? What did they say?\nSpeaker A: All my tests came back negative. I'm completely healthy!\n[TARGET] Speaker B: That's wonderful news! I've been so worried about you!"
  },
  {
    "id": "ece_006",
    "dialogue": "Speaker A: The restaurant we wanted to try just got shut down for health violations.\nSpeaker B: You're kidding! We almost went there last week.\n[TARGET] Speaker B: Ugh, that's disgusting. I'm glad we didn't eat there."
  },
  {
    "id": "ece_007",
    "dialogue": "Speaker A: I saw someone following me on my way home last night.\nSpeaker B: That's scary! Did you call the police?\nSpeaker A: They said they'd increase patrols, but I still have to walk home alone tonight.\n[TARGET] Speaker A: I'm really nervous about going out after dark now."
  },
  {
    "id": "ece_008",
    "dialogue": "Speaker A: Happy birthday! I got you something special.\nSpeaker B: You didn't have to do that!\n[TARGET] Speaker B: Wait... is this... a puppy?! I can't believe it!"
  }
]
