[
  {
    "id": "eae_001",
    "text": "Apple Inc. announced on Tuesday that it will acquire the startup Acme Technologies for $2 billion. The deal is expected to close by the end of March. CEO Tim Cook stated that the acquisition will strengthen Apple's AI capabilities."
  },
  {
    "id": "eae_002",
    "text": "A powerful earthquake struck central Turkey early Monday morning, killing at least 50 people and injuring hundreds more. Rescue teams from neighboring countries have been deployed to the affected regions. The 7.2 magnitude quake damaged thousands of buildings in the city of Adana."
  },
  {
    "id": "eae_003",
    "text": "John Smith was arrested yesterday in connection with the bank robbery that occurred last week in downtown Chicago. Police say Smith was apprehended at his home with $50,000 in cash. He is scheduled to appear in court on Friday."
  },
  {
    "id": "eae_004",
    "text": "The company hired Sarah Johnson as their new Chief Technology Officer. Johnson previously worked at Google for 15 years. She will begin her new role on January 15th at the San Francisco headquarters."
  },
  {
    "id": "eae_005",
    "text": "Thousands of protesters gathered in the capital city on Saturday to demand government action on climate change. The peaceful demonstration, organized by environmental groups, marched from the central square to parliament. Police estimated the crowd at over 10,000 people."
  },
  {
    "id": "eae_006",
    "text": "The jury found the defendant guilty of fraud after a three-week trial. Judge Martinez sentenced him to five years in prison and ordered him to pay $1.5 million in restitution to the victims. The prosecution had originally sought a 10-year sentence."
  },
  {
    "id": "eae_007",
    "text": "A cargo ship carrying electronics from Shanghai to Los Angeles sank in the Pacific Ocean during a severe storm. All 25 crew members were rescued by the Coast Guard. The vessel was carrying approximately $100 million worth of goods."
  },
  {
    "id": "eae_008",
    "text": "Maria Garcia gave birth to twins at Memorial Hospital yesterday. The healthy baby girls, named Sofia and Isabella, weighed 6 and 7 pounds respectively. This is the first set of twins born at the hospital this year."
  },
  {
    "id": "eae_009",
    "text": "The two pharmaceutical companies announced a merger that will create the world's largest drug manufacturer. The combined entity will be valued at over $300 billion. Regulators in the US and EU must approve the deal before it can proceed."
  },
  {
    "id": "eae_010",
    "text": "President Williams met with foreign ministers from five European nations at the summit in Geneva. The leaders discussed trade agreements and security cooperation. The meeting lasted six hours and concluded with a joint statement on climate policy."
  }
]
