[
  {
    "id": "ade_001",
    "text": "I've been taking Lipitor for my high cholesterol for about 3 months now. Started getting terrible muscle pain in my legs and arms. Doctor said it could be a side effect. Had to switch to a different statin."
  },
  {
    "id": "ade_002",
    "text": "Voltaren worked great for my arthritis pain but gave me awful stomach problems. Felt nauseous all the time and even had some bleeding. Not worth it."
  },
  {
    "id": "ade_003",
    "text": "Started taking metformin for type 2 diabetes. First week was rough - lots of diarrhea and stomach cramps. Doctor said to stick with it and symptoms would improve. They did after about 2 weeks."
  },
  {
    "id": "ade_004",
    "text": "This medication is a lifesaver! My migraines are finally under control with Topamax. Only downside is some tingling in my fingers but I can live with that."
  },
  {
    "id": "ade_005",
    "text": "DO NOT TAKE THIS DRUG. Cipro gave me tendon problems that still haven't gone away after 6 months. I can barely walk. Worst decision of my life."
  },
  {
    "id": "ade_006",
    "text": "Been on Lexapro for depression for a year. Works well for my mood but completely killed my libido. Also gained about 15 pounds. Trying to decide if it's worth staying on."
  },
  {
    "id": "ade_007",
    "text": "Took ibuprofen for my back pain as needed. No problems at all. Works better than acetaminophen for me."
  },
  {
    "id": "ade_008",
    "text": "My doctor put me on lisinopril for high blood pressure. Developed this horrible dry cough that wouldn't go away. Switched to losartan and the cough stopped within a week."
  },
  {
    "id": "ade_009",
    "text": "Allergic reaction to amoxicillin - broke out in hives all over my body within an hour of taking it. Had to go to the ER. Now I'm flagged as penicillin allergic."
  },
  {
    "id": "ade_010",
    "text": "Taking atorvastatin 20mg for cholesterol management. No side effects noticed so far after 6 months. Bloodwork shows good improvement in my numbers."
  }
]
